# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scale: n
max_channels: 1024
depth_multiple: 0.50  # scales module repeats
width_multiple: 0.25  # scales convolution channels
ch: 3

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, RepVGGBlock, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]

  - [-4, 1, Conv, [64, 3, 2]] # 3-P1/2
  - [-1, 1, RepVGGBlock, [128, 3, 2]] # 4-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]

  # transformer fusion
  - [[2,5], 1, GPT, [128]] # 6-P2/4
  - [[2,6], 1, Add2, [128,0]]  # 7-P2/4 stream one:x+trans[0]
  - [[5,6], 1, Add2, [128,1]]  # 8-P2/4 stream two:x+trans[1]


  - [7, 1, RepVGGBlock, [256, 3, 2]] # 9-P3/8
  - [-1, 6, C2f_DCN, [256, True]]
  - [8, 1, RepVGGBlock, [256, 3, 2]] # 11-P3/8
  - [-1, 6, C2f_DCN, [256, True]]

  - [[10,12], 1, GPT, [256]]   # 13-P3/8
  - [[10,13], 1, Add2, [256,0]]    # 14-P3/8 stream one x+trans[0]
  - [[12,13], 1, Add2, [256,1]]    # 15-P3/8 stream two x+trans[1]


  - [14, 1, RepVGGBlock, [512, 3, 2]] # 16-P4/16
  - [-1, 6, C2f_DCN, [512, True]]
  - [15, 1, RepVGGBlock, [512, 3, 2]] # 18-P4/16
  - [-1, 6, C2f_DCN, [512, True]]

  # transformer fusion
  - [[17,19], 1, GPT, [512]]   # 20-P3/8
  - [[17,20], 1, Add2, [512,0]]    # 21-P3/8 stream one x+trans[0]
  - [[19,20], 1, Add2, [512,1]]    # 22-P3/8 stream two x+trans[1]

  - [-2, 1, RepVGGBlock, [1024, 3, 2]] # 23-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 25
  - [-1, 2, C2PSA, [1024]] # 26

  - [22, 1, RepVGGBlock, [1024, 3, 2]] # 27-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 29
  - [-1, 2, C2PSA, [1024]] # 30

  # transformer fusion
  - [[26,30], 1, GPT, [1024]]    # 31-P5/32
  - [[26,31], 1, Add2, [1024,0]]    # 32-P5/32 stream one x+trans[0]
  - [[30,31], 1, Add2, [1024,1]]    # 33-P5/32 stream two x+trans[1]

  ######### Add Block #############
  - [[7,8], 1, Add, [1]]   # 34-P3/8 fusion backbone P2
  - [[14,15], 1, Add, [1]]   # 35-P3/8 fusion backbone P3
  - [[21,22], 1, Add, [1]]   # 36-P4/16 fusion backbone P4
  - [[32,33], 1, Add, [1]]   # 37-P5/32 fusion backbone P5


# YOLO11n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [35, 1, SepDwConv, [512, 3, 2]]
  - [[38, 36, -1], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #42
  - [34, 1, SepDwConv, [256, 3, 2]]
  - [[42, 35, -1], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 16 (P3/8-small)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #46
  - [0, 1, SepDwConv, [64, 3, 2]]
  - [[46, 34, -1], 1, Concat, [1]] # cat backbone P2
  - [-1, 2, C3k2, [128, False]] # 22 (P2/8-small)

  - [-1, 1, Conv, [128, 3, 2]] #50
  - [[-1, 45], 1, Concat, [1]] # cat head P3
  - [-1, 2, C3k2, [256, False]] # 25 (P4/16-medium)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 41], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, False]] # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 37], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 22 (P5/32-large)

  - [[52, 55, 58], 1, Detect, [nc]] # Detect(P3, P4, P5)
