# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scale: n
max_channels: 1024
depth_multiple: 0.50  # scales module repeats
width_multiple: 0.25  # scales convolution channels
ch: 3

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  ######### TransformerBlock One #############
  # stream one
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  # stream two
  - [-4, 1, Conv, [64, 3, 2]] # 5-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 6-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 8-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]

  ######### TransformerBlock Two #############
  # transformer fusion
  - [[4,9], 1, GPT, [256]]   # 10-P3/8
  - [[4,10], 1, Add2, [256,0]]    # 11-P3/8 stream one x+trans[0]
  - [[9,10], 1, Add2, [256,1]]    # 12-P3/8 stream two x+trans[1]

  ######### TransformerBlock Three #############
  # stream one
  - [11, 1, Conv, [512, 3, 2]] # 13-P4/16
  - [-1, 2, C3k2, [512, True]]
  # stream two
  - [12, 1, Conv, [512, 3, 2]] # 15-P4/16
  - [-1, 2, C3k2, [512, True]]
  # transformer fusion
  - [[14,16], 1, GPT, [512]]   # 17-P3/8
  - [[14,17], 1, Add2, [512,0]]    # 18-P3/8 stream one x+trans[0]
  - [[16,17], 1, Add2, [512,1]]    # 19-P3/8 stream two x+trans[1]

  ######### TransformerBlock Four #############
  # stream one
  - [18, 1, Conv, [1024, 3, 2]] # 20-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 22
  - [-1, 2, C2PSA, [1024]] # 23
  # stream two
  - [19, 1, Conv, [1024, 3, 2]] # 24-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 26
  - [-1, 2, C2PSA, [1024]] # 27
  # transformer fusion
  - [[23,27], 1, GPT, [1024]]   # 28-P5/32
  - [[23,28], 1, Add2, [1024,0]]    # 29-P5/32 stream one x+trans[0]
  - [[27,28], 1, Add2, [1024,1]]    # 30-P5/32 stream two x+trans[1]
  ######### Add Block #############
  - [[11,12], 1, Add, [1]]   # 31-P3/8 fusion backbone P3
  - [[18,19], 1, Add, [1]]   # 32-P4/16 fusion backbone P4
  - [[29,30], 1, Add, [1]]   # 33-P5/32 fusion backbone P5

# YOLO11n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 32], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 36

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 31], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 39 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 36], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, False]] # 42 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 33], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 45 (P5/32-large)

  - [[39, 42, 45], 1, Detect, [nc]] # Detect(P3, P4, P5)
